chouchiate/MC56_LLC_800W_DCDC/board/peripherals.c
/****************************************************************************/
/* Fault channel1 initialization */
/****************************************************************************/
  /* Fault setting are shared for all submodules, it is allowed to initiate it in each
     initialization function, but suggest to initiate it only once. */
#ifdef PWMA_FCTRL1_INIT
  PWMA->FAULT[1].FCTRL = PWMA_FCTRL1_INIT;
#else
  PWMA->FAULT[1].FCTRL = 0x0U;
#endif /* PWMA_FCTRL1_INIT */
#ifdef PWMA_FSTS1_INIT
  PWMA->FAULT[1].FSTS = PWMA_FSTS1_INIT;
#else
  PWMA->FAULT[1].FSTS = 0xfU;
#endif /* PWMA_FSTS1_INIT */
#ifdef PWMA_FFILT1_INIT
  PWMA->FAULT[1].FFILT = PWMA_FFILT1_INIT;
#else
  PWMA->FAULT[1].FFILT = 0x0U;
#endif /* PWMA_FFILT1_INIT */
#ifdef PWMA_FTST1_INIT
  PWMA->FAULT[1].FTST = PWMA_FTST1_INIT;
#else
  PWMA->FAULT[1].FTST = 0x0U;
#endif /* PWMA_FTST1_INIT */
#ifdef PWM_FCTRL2_NOCOMB_MASK
#ifdef PWMA_FCTRL21_INIT
  PWMA->FAULT[1].FCTRL2 = PWMA_FCTRL21_INIT;
#else
  PWMA->FAULT[1].FCTRL2 = 0x0U;
#endif /* PWMA_FCTRL21_INIT */
#endif /* PWM_FCTRL2_NOCOMB_MASK */

/****************************************************************************/
/* PWMA initialization */
/****************************************************************************/
#ifdef PWMA_OUTEN_INIT
  PWMA->OUTEN = (PWMA->OUTEN & (~PWMA_OUTEN_INIT_MASK)) | (PWMA_OUTEN_INIT & PWMA_OUTEN_INIT_MASK);
#endif /* PWMA_PWMA_OUTEN_INIT */
#ifdef PWMA_MASK_INIT
  PWMA->MASK = (PWMA->MASK & (~PWMA_MASK_INIT_MASK)) | (PWMA_MASK_INIT & PWMA_MASK_INIT_MASK);
#endif /* PWMA_PWMA_MASK_INIT */
#ifdef PWMA_SWCOUT_INIT
  PWMA->SWCOUT = (PWMA->SWCOUT & (~PWMA_SWCOUT_INIT_MASK)) | (PWMA_SWCOUT_INIT & PWMA_SWCOUT_INIT_MASK);
#endif /* PWMA_PWMA_SWCOUT_INIT */
#ifdef PWMA_DTSRCSEL_INIT
  PWMA->DTSRCSEL = (PWMA->DTSRCSEL & (~PWMA_DTSRCSEL_INIT_MASK)) | (PWMA_DTSRCSEL_INIT & PWMA_DTSRCSEL_INIT_MASK);
#endif /* PWMA_PWMA_DTSRCSEL_INIT */
#ifdef PWMA_MCTRL2_INIT
  PWMA->MCTRL2 = PWMA_MCTRL2_INIT;
#endif /* PWMA_PWMA_MCTRL2_INIT */
#ifdef PWMA_MCTRL_INIT
  PWMA->MCTRL = (PWMA->MCTRL & (~PWMA_MCTRL_INIT_MASK)) | (PWMA_MCTRL_INIT & PWMA_MCTRL_INIT_MASK);
#endif /* PWMA_PWMA_MCTRL_INIT */
#ifdef PWMA_SM0CTRL_INIT
#if ((!defined(PWMA_SM0CTRL2_INIT)) || (0U == (PWMA_SM0CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[0].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM0CTRL2_INIT)) || (0U == (PWMA_SM0CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM0CTRL_INIT */
#ifdef PWMA_SM1CTRL_INIT
#if ((!defined(PWMA_SM1CTRL2_INIT)) || (0U == (PWMA_SM1CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[1].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM1CTRL2_INIT)) || (0U == (PWMA_SM1CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM1CTRL_INIT */
#ifdef PWMA_SM2CTRL_INIT
#if ((!defined(PWMA_SM2CTRL2_INIT)) || (0U == (PWMA_SM2CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[2].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM2CTRL2_INIT)) || (0U == (PWMA_SM2CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM2CTRL_INIT */
#ifdef PWMA_SM3CTRL_INIT
#if ((!defined(PWMA_SM3CTRL2_INIT)) || (0U == (PWMA_SM3CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK)))
  PWMA->SM[3].CTRL2 |= PWM_CTRL2_FORCE(1U);
#endif /* ((!defined(PWMA_SM3CTRL2_INIT)) || (0U == (PWMA_SM3CTRL2_INIT & PWM_CTRL2_FORCE_SEL_MASK))) */
#endif /* PWMA_SM3CTRL_INIT */
}

/***********************************************************************************************************************
 * QSCI0 initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'QSCI0'
- type: 'qsci_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'qsci_reg_2d9323f68f6773d3646d5e49c6c75606'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'QSCI0'
- config_sets:
  - fsl_qsci:
    - qsciConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - DividerBaudRateStr: '115200bps'
      - parityEnable: 'false'
      - parityMode: '0'
      - dataBitCount: '0'
      - polarityMode: '0'
      - fifoEn: 'false'
      - txFifoWatermark: '0'
      - rxFifoWatermark: '1'
      - enableTx: 'false'
      - enableRx: 'false'
      - LINSlaveEnable: 'false'
      - LoopEnable: 'false'
      - ReceiverSource: '0'
      - WaitEnable: 'false'
      - StopHoldEnable: 'false'
      - StandbyEnable: 'false'
      - WakeUpCondition: '0'
      - txDMAEn: 'false'
      - rxDMAEn: 'false'
      - interrupt_vectors:
        - interrupt_types: ''
        - enable_tx_irq: 'false'
        - interrupt_tx:
          - IRQn: 'kQSCI0_TDRE_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_rx_irq: 'false'
        - interrupt_rx:
          - IRQn: 'kQSCI0_RCV_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_rx_err_irq: 'false'
        - interrupt_rx_err:
          - IRQn: 'kQSCI0_RERR_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_tridle_irq: 'false'
        - interrupt_tridle:
          - IRQn: 'kQSCI0_TRIDLE_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
    - qsci_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void QSCI0_init(void) {
/****************************************************************************/
/* QSCI0 initialization */
/****************************************************************************/
  /* Software peripheral reset to a known state. */
  SIM->PSWR1 |= SIM_PSWR1_SCI0_MASK;
  SIM->PSWR1 &= ~ SIM_PSWR1_SCI0_MASK;
#if defined(QSCI0_RATE_INIT)
  QSCI0->RATE = QSCI0_RATE_INIT;
#endif /* QSCI0_RATE_INIT */
#if defined(QSCI0_CTRL2_INIT)
  QSCI0->CTRL2 = QSCI0_CTRL2_INIT;
#endif /* QSCI0_CTRL2_INIT */
#if defined(QSCI0_CTRL3_INIT)
  QSCI0->CTRL3 = QSCI0_CTRL3_INIT;
#endif /* QSCI0_CTRL3_INIT */
#if defined(QSCI0_CTRL1_INIT)
  QSCI0->CTRL1 = QSCI0_CTRL1_INIT;
#endif /* QSCI0_CTRL1_INIT */

