chouchiate/MC56_LLC_800W_DCDC/board/peripherals.c
}

/***********************************************************************************************************************
 * ADC initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'ADC'
- type: 'cadc_reg'
- mode: 'CADC'
- custom_name_enabled: 'false'
- type_id: 'cadc_reg_3aa3a1e7f4a7b23ac90f68072daac258'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'ADC'
- config_sets:
  - fsl_cadc:
    - cadcConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - dualConverterScanMode: 'kCADC_DualConverterWorkAsTriggeredParallel'
      - enableSimultaneousMode: 'true'
      - DMATriggerSource: 'kCADC_DMATriggerSourceAsEndOfScan'
      - powerUpDelay: '26'
      - autoPowerDown: 'false'
      - clockDivisorInt: '4'
      - enableDMA0: 'false'
      - enableStop0: 'false'
      - startConversion0: 'true'
      - enableSYNC0: 'true'
      - manualPowerDownA: 'false'
      - highReferenceA: 'vdda'
      - lowReferenceA: 'vssa'
      - onChipAnalogInputA: 'normal'
      - tempSensorA: 'normal'
      - manualPowerDownB: 'false'
      - highReferenceB: 'vdda'
      - lowReferenceB: 'vssa'
      - onChipAnalogInputB: 'normal'
      - tempSensorB: 'normal'
    - channelConfig:
      - 0:
        - chMode: '0'
      - 1:
        - chMode: '0'
      - 2:
        - chMode: '0'
      - 3:
        - chMode: '0'
      - 4:
        - chMode: '0'
      - 5:
        - chMode: '0'
      - 6:
        - chMode: '0'
      - 7:
        - chMode: '0'
    - inputGainConfig:
      - channels_inputGain_convA:
        - 0:
          - channelGain: '0'
        - 1:
          - channelGain: '0'
        - 2:
          - channelGain: '0'
        - 3:
          - channelGain: '0'
        - 4:
          - channelGain: '0'
        - 5:
          - channelGain: '0'
        - 6:
          - channelGain: '0'
        - 7:
          - channelGain: '0'
        - 8:
          - channelGain: '0'
        - 9:
          - channelGain: '0'
      - channels_inputGain_convB:
        - 0:
          - channelGain: '0'
        - 1:
          - channelGain: '0'
        - 2:
          - channelGain: '0'
        - 3:
          - channelGain: '0'
        - 4:
          - channelGain: '0'
        - 5:
          - channelGain: '0'
        - 6:
          - channelGain: '0'
        - 7:
          - channelGain: '0'
        - 8:
          - channelGain: '0'
        - 9:
          - channelGain: '0'
    - channels_config:
      - 0:
        - sampleName: 'Sample_0'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_1'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_2'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_3'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_4'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_5'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_6'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_7'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_8'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_9'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 10:
        - sampleName: 'Sample_10'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 11:
        - sampleName: 'Sample_11'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 12:
        - sampleName: 'Sample_12'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 13:
        - sampleName: 'Sample_13'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 14:
        - sampleName: 'Sample_14'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 15:
        - sampleName: 'Sample_15'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 16:
        - sampleName: 'Sample_16'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 17:
        - sampleName: 'Sample_17'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 18:
        - sampleName: 'Sample_18'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 19:
        - sampleName: 'Sample_19'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - channels_config_A_parallel:
      - 0:
        - sampleName: 'Sample_0'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_1'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.1'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_2'
        - disableSample: 'false'
        - channelNumberEnum: 'ANA.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_3'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_4'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_5'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_6'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_7'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_16'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_17'
        - disableSample: 'true'
        - channelNumberEnum: 'ANA.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - channels_config_B_parallel:
      - 0:
        - sampleName: 'Sample_8'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 1:
        - sampleName: 'Sample_9'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.0'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 2:
        - sampleName: 'Sample_10'
        - disableSample: 'false'
        - channelNumberEnum: 'ANB.2'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 3:
        - sampleName: 'Sample_11'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.3'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 4:
        - sampleName: 'Sample_12'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.4'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 5:
        - sampleName: 'Sample_13'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.5'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 6:
        - sampleName: 'Sample_14'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.6'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 7:
        - sampleName: 'Sample_15'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.7'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 8:
        - sampleName: 'Sample_18'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.8'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
      - 9:
        - sampleName: 'Sample_19'
        - disableSample: 'true'
        - channelNumberEnum: 'ANB.9'
        - zeroCrossingMode: '0'
        - highLimitValue: '4095'
        - lowLimitValue: '0'
        - offsetValue: '0'
        - enableWaitSync: 'false'
        - enableSampleInterrupt: 'false'
        - cadcTemplateSampleVariables: []
    - interrupt:
      - interruptSources: 'kCADC_ConverterAEndOfScanInterruptEnable'
      - enable_err_irq: 'false'
      - interrupt_err:
        - IRQn: 'kADC12_ERR_VECTORn'
        - dsc_enable_interrrupt: 'iprVal0'
        - enable_custom_name: 'false'
      - enable_cc0_irq: 'true'
      - interrupt_cc0:
        - IRQn: 'kADC12_CC0_VECTORn'
        - dsc_enable_interrrupt: 'iprVal3'
        - enable_custom_name: 'false'
      - enable_cc1_irq: 'false'
      - interrupt_cc1:
        - IRQn: 'kADC12_CC1_VECTORn'
        - dsc_enable_interrrupt: 'iprVal0'
        - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void ADC_init(void) {
  /* Software reset Cyclic ADC. */
  SIM->PSWR2 |= SIM_PSWR2_CYCADC_MASK;
  SIM->PSWR2 &= ~ SIM_PSWR2_CYCADC_MASK;
#if defined(ADC_CTRL1_INIT)
  ADC->CTRL1 = ADC_CTRL1_INIT;
#endif /* ADC_CTRL1_INIT */
#if defined(ADC_CTRL2_INIT)
  ADC->CTRL2 = ADC_CTRL2_INIT;
#endif /* ADC_CTRL2_INIT */
#if defined(ADC_STAT_INIT)
  ADC->STAT = ADC_STAT_INIT;
#endif /* ADC_STAT_INIT */
#if defined(ADC_PWR_INIT)
  ADC->PWR = ADC_PWR_INIT;
#if (defined(ADC_PWR_INIT) && (((ADC_PWR_INIT) & (ADC_PWR_PD0_MASK | ADC_PWR_APD_MASK)) == 0UL))
while(((ADC->PWR) & ADC_PWR_PSTS0_MASK) != 0UL)
{}
#elif (defined(ADC_PWR_INIT) && (((ADC_PWR_INIT) & (ADC_PWR_PD1_MASK | ADC_PWR_APD_MASK)) == 0UL))
while(((ADC->PWR) & ADC_PWR_PSTS1_MASK) != 0UL)
{}
#elif (defined(ADC_PWR_INIT) && (((ADC_PWR_INIT) & (ADC_PWR_PD0_MASK | ADC_PWR_PD1_MASK | ADC_PWR_APD_MASK)) == 0UL))
while(((ADC->PWR) & (ADC_PWR_PSTS1_MASK | ADC_PWR_PSTS0_MASK)) != 0UL)
{}
#endif /* defined(ADC_PWR_INIT) && (((ADC_PWR_INIT) & (ADC_PWR_PD0_MASK | ADC_PWR_APD_MASK)) == 0UL) */
#endif /* ADC_PWR_INIT */
#if defined(ADC_CAL_INIT)
  ADC->CAL = ADC_CAL_INIT;
#endif /* ADC_CAL_INIT */
#if defined(ADC_PWR2_INIT)
  ADC->PWR2 = ADC_PWR2_INIT;
#endif /* ADC_PWR2_INIT */
#if defined(ADC_CTRL3_INIT)
  ADC->CTRL3 = ADC_CTRL3_INIT;
#endif /* ADC_CTRL3_INIT */
#if defined(ADC_ZXCTRL1_INIT)
  ADC->ZXCTRL1 = ADC_ZXCTRL1_INIT;
#endif /* ADC_ZXCTRL1_INIT */
#if defined(ADC_ZXCTRL2_INIT)
  ADC->ZXCTRL2 = ADC_ZXCTRL2_INIT;
#endif /* ADC_ZXCTRL2_INIT */
#if defined(ADC_ZXCTRL3_INIT)
  ADC->ZXCTRL3 = ADC_ZXCTRL3_INIT;
#endif /* ADC_ZXCTRL3_INIT */
#if defined(ADC_CLIST1_INIT)
  ADC->CLIST1 = ADC_CLIST1_INIT;
#endif /* ADC_CLIST1_INIT */
#if defined(ADC_CLIST2_INIT)
  ADC->CLIST2 = ADC_CLIST2_INIT;
#endif /* ADC_CLIST2_INIT */
#if defined(ADC_CLIST3_INIT)
  ADC->CLIST3 = ADC_CLIST3_INIT;
#endif /* ADC_CLIST3_INIT */
#if defined(ADC_CLIST4_INIT)
  ADC->CLIST4 = ADC_CLIST4_INIT;
#endif /* ADC_CLIST4_INIT */
#if defined(ADC_CLIST5_INIT)
  ADC->CLIST5 = ADC_CLIST5_INIT;
#endif /* ADC_CLIST5_INIT */
#if defined(ADC_SDIS_INIT)
  ADC->SDIS = ADC_SDIS_INIT;
#endif /* ADC_SDIS_INIT */
#if defined(ADC_SDIS2_INIT)
  ADC->SDIS2 = ADC_SDIS2_INIT;
#endif /* ADC_SDIS2_INIT */
#if defined(ADC_LOLIMSTAT_INIT)
  ADC->LOLIMSTAT = ADC_LOLIMSTAT_INIT;
#endif /* ADC_LOLIMSTAT_INIT */
#if defined(ADC_LOLIMSTAT2_INIT)
  ADC->LOLIMSTAT2 = ADC_LOLIMSTAT2_INIT;
#endif /* ADC_LOLIMSTAT2_INIT */
#if defined(ADC_HILIMSTAT_INIT)
  ADC->HILIMSTAT = ADC_HILIMSTAT_INIT;
#endif /* ADC_HILIMSTAT_INIT */
#if defined(ADC_HILIMSTAT2_INIT)
  ADC->HILIMSTAT2 = ADC_HILIMSTAT2_INIT;
#endif /* ADC_HILIMSTAT2_INIT */
#if defined(ADC_ZXSTAT_INIT)
  ADC->ZXSTAT = ADC_ZXSTAT_INIT;
#endif /* ADC_ZXSTAT_INIT */
#if defined(ADC_ZXSTAT2_INIT)
  ADC->ZXSTAT2 = ADC_ZXSTAT2_INIT;
#endif /* ADC_ZXSTAT2_INIT */
#if defined(ADC_GC1_INIT)
  ADC->GC1 = ADC_GC1_INIT;
#endif /* ADC_GC1_INIT */
#if defined(ADC_GC2_INIT)
  ADC->GC2 = ADC_GC2_INIT;
#endif /* ADC_GC2_INIT */
#if defined(ADC_GC3_INIT)
  ADC->GC3 = ADC_GC3_INIT;
#endif /* ADC_GC3_INIT */
#if defined(ADC_SCTRL_INIT)
  ADC->SCTRL = ADC_SCTRL_INIT;
#endif /* ADC_SCTRL_INIT */
#if defined(ADC_SCTRL2_INIT)
  ADC->SCTRL2 = ADC_SCTRL2_INIT;
#endif /* ADC_SCTRL2_INIT */
#if defined(ADC_SCHLTEN_INIT)
  ADC->SCHLTEN = ADC_SCHLTEN_INIT;
#endif /* ADC_SCHLTEN_INIT */
#if defined(ADC_SCHLTEN2_INIT)
  ADC->SCHLTEN2 = ADC_SCHLTEN2_INIT;
#endif /* ADC_SCHLTEN2_INIT */
#if defined(ADC_EXPCFG_INIT)
  ADC->EXPCFG = ADC_EXPCFG_INIT;
#endif /* ADC_EXPCFG_INIT */
#if defined(ADC_EXPAUX4A_INIT)
  ADC->EXPAUX4A = ADC_EXPAUX4A_INIT;
#endif /* ADC_EXPAUX4A_INIT */
#if defined(ADC_EXPAUX4B_INIT)
  ADC->EXPAUX4B = ADC_EXPAUX4B_INIT;
#endif /* ADC_EXPAUX4B_INIT */
#if defined(ADC_EXPMUX4A0_INIT)
  ADC->EXPMUX4A0 = ADC_EXPMUX4A0_INIT;
#endif /* ADC_EXPMUX4A0_INIT */
#if defined(ADC_EXPMUX4A1_INIT)
  ADC->EXPMUX4A1 = ADC_EXPMUX4A1_INIT;
#endif /* ADC_EXPMUX4A1_INIT */
#if defined(ADC_EXPMUX4B0_INIT)
  ADC->EXPMUX4B0 = ADC_EXPMUX4B0_INIT;
#endif /* ADC_EXPMUX4B0_INIT */
#if defined(ADC_EXPMUX4B1_INIT)
  ADC->EXPMUX4B1 = ADC_EXPMUX4B1_INIT;
#endif /* ADC_EXPMUX4B1_INIT */

