chouchiate/MC56_LLC_800W_DCDC/board/peripherals.c
/***********************************************************************************************************************
 * DACA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'DACA'
- type: 'dac_reg'
- mode: 'dac_general'
- custom_name_enabled: 'false'
- type_id: 'dac_reg_826d5f280a25f7cdf5d84a53bf6614d6'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'DACA'
- config_sets:
  - fsl_dac:
    - dacConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'ClocksTool_DefaultInit'
      - dataFormat: '0'
      - dac_mode: '0'
      - normal_mode:
        - value: '0'
      - conversionMode: '0'
      - syncEdge: '0'
      - speedMode: '0'
      - enableDMA: 'false'
      - watermarkLevel: '1'
      - enableGlitchFilter: 'true'
      - filterCount: '29'
      - powerDown: 'false'
    - dac_template_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void DACA_init(void) {
/****************************************************************************/
/* DACA initialization */
/****************************************************************************/
  /* Software reset DACA. */
  SIM->PSWR1 |= SIM_PSWR1_DACA_MASK;
  SIM->PSWR1 &= ~ SIM_PSWR1_DACA_MASK;
#if (DACA_CTRL0_INIT & DAC_CTRL0_FORMAT_MASK)
  DACA->CTRL0 |= DAC_CTRL0_FORMAT_MASK;
#endif /* DACA_CTRL0_INIT & DAC_CTRL0_FORMAT_MASK */
#if ((DACA_CTRL0_INIT & DAC_CTRL0_PDN_MASK) == 0U)
  DACA->CTRL0 &= ~DAC_CTRL0_PDN_MASK;
  SDK_DelayAtLeastUs(12, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
#endif /* (DACA_CTRL0_INIT & DAC_CTRL0_PDN_MASK) == 0U */
#if defined(DACA_DATAREG_FMT0_INIT)
  DACA->FMT0.DATAREG_FMT0 = DACA_DATAREG_FMT0_INIT;
#endif /* DACA_DATAREG_FMT0_INIT */
#if defined(DACA_DATAREG_FMT1_INIT)
  DACA->FMT1.DATAREG_FMT1 = DACA_DATAREG_FMT1_INIT;
#endif /* DACA_DATAREG_FMT1_INIT */
#if defined(DACA_STEPVAL_FMT0_INIT)
  DACA->FMT0.STEPVAL_FMT0 = DACA_STEPVAL_FMT0_INIT;
#endif /* DACA_STEPVAL_FMT0_INIT */
#if defined(DACA_STEPVAL_FMT1_INIT)
  DACA->FMT1.STEPVAL_FMT1 = DACA_STEPVAL_FMT1_INIT;
#endif /* DACA_STEPVAL_FMT1_INIT */
#if defined(DACA_MINVAL_FMT0_INIT)
   DACA->FMT0.MINVAL_FMT0 = DACA_MINVAL_FMT0_INIT;
#endif /* DACA_MINVAL_FMT0_INIT */
#if defined(DACA_MINVAL_FMT1_INIT)
   DACA->FMT1.MINVAL_FMT1 = DACA_MINVAL_FMT1_INIT;
#endif /* DACA_MINVAL_FMT1_INIT */
#if defined(DACA_MAXVAL_FMT0_INIT)
  DACA->FMT0.MAXVAL_FMT0 = DACA_MAXVAL_FMT0_INIT;
#endif /* DACA_MAXVAL_FMT0_INIT */
#if defined(DACA_MAXVAL_FMT1_INIT)
  DACA->FMT1.MAXVAL_FMT1 = DACA_MAXVAL_FMT1_INIT;
#endif /* DACA_MAXVAL_FMT1_INIT */
#if defined(DACA_CTRL1_INIT)
  DACA->CTRL1 = DACA_CTRL1_INIT;
#endif /* DACA_CTRL1_INIT */
#if defined(DACA_COMPARE_INIT)
  DACA->COMPARE = DACA_COMPARE_INIT;
#endif /* DACA_COMPARE_INIT */
#if defined(DACA_CTRL0_INIT)
#if defined(DACA_FIRST_COUNT_DIR_MASK)
  DACA->CTRL0 = (DACA_CTRL0_INIT & ~(DACA_FIRST_COUNT_DIR_MASK));
#endif /* DACA_FIRST_COUNT_DIR_MASK */
  DACA->CTRL0 = DACA_CTRL0_INIT;
#endif /* DACA_CTRL0_INIT */

}

/***********************************************************************************************************************
 * DACB initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'DACB'
- type: 'dac_reg'
- mode: 'dac_general'
- custom_name_enabled: 'false'
- type_id: 'dac_reg_826d5f280a25f7cdf5d84a53bf6614d6'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'DACB'
- config_sets:
  - fsl_dac:
    - dacConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'ClocksTool_DefaultInit'
      - dataFormat: '0'
      - dac_mode: '0'
      - normal_mode:
        - value: '0'
      - conversionMode: '0'
      - syncEdge: '0'
      - speedMode: '0'
      - enableDMA: 'false'
      - watermarkLevel: '1'
      - enableGlitchFilter: 'true'
      - filterCount: '29'
      - powerDown: 'false'
    - dac_template_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void DACB_init(void) {
/****************************************************************************/
/* DACB initialization */
/****************************************************************************/
  /* Software reset DACB. */
  SIM->PSWR1 |= SIM_PSWR1_DACB_MASK;
  SIM->PSWR1 &= ~ SIM_PSWR1_DACB_MASK;
#if (DACB_CTRL0_INIT & DAC_CTRL0_FORMAT_MASK)
  DACB->CTRL0 |= DAC_CTRL0_FORMAT_MASK;
#endif /* DACB_CTRL0_INIT & DAC_CTRL0_FORMAT_MASK */
#if ((DACB_CTRL0_INIT & DAC_CTRL0_PDN_MASK) == 0U)
  DACB->CTRL0 &= ~DAC_CTRL0_PDN_MASK;
  SDK_DelayAtLeastUs(12, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
#endif /* (DACB_CTRL0_INIT & DAC_CTRL0_PDN_MASK) == 0U */
#if defined(DACB_DATAREG_FMT0_INIT)
  DACB->FMT0.DATAREG_FMT0 = DACB_DATAREG_FMT0_INIT;
#endif /* DACB_DATAREG_FMT0_INIT */
#if defined(DACB_DATAREG_FMT1_INIT)
  DACB->FMT1.DATAREG_FMT1 = DACB_DATAREG_FMT1_INIT;
#endif /* DACB_DATAREG_FMT1_INIT */
#if defined(DACB_STEPVAL_FMT0_INIT)
  DACB->FMT0.STEPVAL_FMT0 = DACB_STEPVAL_FMT0_INIT;
#endif /* DACB_STEPVAL_FMT0_INIT */
#if defined(DACB_STEPVAL_FMT1_INIT)
  DACB->FMT1.STEPVAL_FMT1 = DACB_STEPVAL_FMT1_INIT;
#endif /* DACB_STEPVAL_FMT1_INIT */
#if defined(DACB_MINVAL_FMT0_INIT)
   DACB->FMT0.MINVAL_FMT0 = DACB_MINVAL_FMT0_INIT;
#endif /* DACB_MINVAL_FMT0_INIT */
#if defined(DACB_MINVAL_FMT1_INIT)
   DACB->FMT1.MINVAL_FMT1 = DACB_MINVAL_FMT1_INIT;
#endif /* DACB_MINVAL_FMT1_INIT */
#if defined(DACB_MAXVAL_FMT0_INIT)
  DACB->FMT0.MAXVAL_FMT0 = DACB_MAXVAL_FMT0_INIT;
#endif /* DACB_MAXVAL_FMT0_INIT */
#if defined(DACB_MAXVAL_FMT1_INIT)
  DACB->FMT1.MAXVAL_FMT1 = DACB_MAXVAL_FMT1_INIT;
#endif /* DACB_MAXVAL_FMT1_INIT */
#if defined(DACB_CTRL1_INIT)
  DACB->CTRL1 = DACB_CTRL1_INIT;
#endif /* DACB_CTRL1_INIT */
#if defined(DACB_COMPARE_INIT)
  DACB->COMPARE = DACB_COMPARE_INIT;
#endif /* DACB_COMPARE_INIT */
#if defined(DACB_CTRL0_INIT)
#if defined(DACB_FIRST_COUNT_DIR_MASK)
  DACB->CTRL0 = (DACB_CTRL0_INIT & ~(DACB_FIRST_COUNT_DIR_MASK));
#endif /* DACB_FIRST_COUNT_DIR_MASK */
  DACB->CTRL0 = DACB_CTRL0_INIT;
#endif /* DACB_CTRL0_INIT */

