chouchiate/MC56_LLC_800W_DCDC/board/peripherals.c
}

/***********************************************************************************************************************
 * CMPA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'CMPA'
- type: 'cmp_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'cmp_reg_3fe3364eca8ece52bd212873a03681c2'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'CMPA'
- config_sets:
  - fsl_filter:
    - filter_config:
      - clockSource: 'SystemClock'
      - clockSourceFreq: 'ClocksTool_DefaultInit'
      - filterPeriod: '0'
      - filterCount2: '0'
    - quick_selection: 'cmp_default'
  - fsl_cmp:
    - main_config:
      - explicitEnableCmp: 'true'
      - filterModes: 'm0'
      - hysteresisMode: 'kCMP_HysteresisLevel0'
      - enableHighSpeed: 'true'
      - enableInvertOutput: 'false'
      - useUnfilteredOutput: 'false'
      - enablePinOut: 'false'
    - positiveChannel: 'IN.0'
    - negativeChannel: 'IN.7'
  - fsl_dac:
    - enableDAC: 'true'
    - dac_config:
      - referenceVoltageSource: 'DAC_8bit_VIN1'
      - DACValue: '177'
  - interrupt:
    - interrupt_sel: 'kCMP_OutputRisingInterruptEnable kCMP_OutputFallingInterruptEnable'
    - enableDma: 'false'
    - enable_irq: 'true'
    - interrupt:
      - IRQn: 'kCMPA_VECTORn'
      - dsc_enable_interrrupt: 'iprVal3'
      - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void CMPA_init(void) {
  /* Software reset the CMPA. */
  CMPA->CR0   = 0U;
  CMPA->CR1   = 0U;
  CMPA->FPR   = 0U;
  CMPA->SCR   = 0U;
  CMPA->DACCR = 0U;
  CMPA->MUXCR = 0U;
#if defined(CMPA_CR0_INIT)
  CMPA->CR0 = CMPA_CR0_INIT;
#endif /* CMPA_CR0_INIT */
#if defined(CMPA_FPR_INIT)
  CMPA->FPR = CMPA_FPR_INIT;
#endif /* CMPA_FPR_INIT */
#if defined(CMPA_SCR_INIT)
  CMPA->SCR = CMPA_SCR_INIT;
#endif /* CMPA_SCR_INIT */
#if defined(CMPA_DACCR_INIT)
  CMPA->DACCR = CMPA_DACCR_INIT;
#endif /* CMPA_DACCR_INIT */
#if defined(CMPA_MUXCR_INIT)
  CMPA->MUXCR = CMPA_MUXCR_INIT;
#endif /* CMPA_MUXCR_INIT */
#if defined(CMPA_CR1_INIT)
  CMPA->CR1 = CMPA_CR1_INIT;
#endif /* CMPA_CR1_INIT */
}

/***********************************************************************************************************************
 * CMPB initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'CMPB'
- type: 'cmp_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'cmp_reg_3fe3364eca8ece52bd212873a03681c2'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'CMPB'
- config_sets:
  - fsl_filter:
    - filter_config:
      - clockSource: 'SystemClock'
      - clockSourceFreq: 'ClocksTool_DefaultInit'
      - filterPeriod: '0'
      - filterCount2: '0'
    - quick_selection: 'cmp_default'
  - fsl_cmp:
    - main_config:
      - explicitEnableCmp: 'true'
      - filterModes: 'm0'
      - hysteresisMode: 'kCMP_HysteresisLevel0'
      - enableHighSpeed: 'true'
      - enableInvertOutput: 'false'
      - useUnfilteredOutput: 'false'
      - enablePinOut: 'false'
    - positiveChannel: 'IN.3'
    - negativeChannel: 'IN.7'
  - fsl_dac:
    - enableDAC: 'true'
    - dac_config:
      - referenceVoltageSource: 'DAC_8bit_VIN1'
      - DACValue: '250'
  - interrupt:
    - interrupt_sel: 'kCMP_OutputRisingInterruptEnable'
    - enableDma: 'false'
    - enable_irq: 'true'
    - interrupt:
      - IRQn: 'kCMPB_VECTORn'
      - dsc_enable_interrrupt: 'iprVal3'
      - enable_custom_name: 'false'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void CMPB_init(void) {
  /* Software reset the CMPB. */
  CMPB->CR0   = 0U;
  CMPB->CR1   = 0U;
  CMPB->FPR   = 0U;
  CMPB->SCR   = 0U;
  CMPB->DACCR = 0U;
  CMPB->MUXCR = 0U;
#if defined(CMPB_CR0_INIT)
  CMPB->CR0 = CMPB_CR0_INIT;
#endif /* CMPB_CR0_INIT */
#if defined(CMPB_FPR_INIT)
  CMPB->FPR = CMPB_FPR_INIT;
#endif /* CMPB_FPR_INIT */
#if defined(CMPB_SCR_INIT)
  CMPB->SCR = CMPB_SCR_INIT;
#endif /* CMPB_SCR_INIT */
#if defined(CMPB_DACCR_INIT)
  CMPB->DACCR = CMPB_DACCR_INIT;
#endif /* CMPB_DACCR_INIT */
#if defined(CMPB_MUXCR_INIT)
  CMPB->MUXCR = CMPB_MUXCR_INIT;
#endif /* CMPB_MUXCR_INIT */
#if defined(CMPB_CR1_INIT)
  CMPB->CR1 = CMPB_CR1_INIT;
#endif /* CMPB_CR1_INIT */
}

/***********************************************************************************************************************
 * I2C0 initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'I2C0'
- type: 'i2c_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'i2c_reg_dffe0fc17c81d4dae066a1e858fe3caa'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'I2C0'
- config_sets:
  - generalConfig:
    - IICEN: 'false'
    - clkConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'ClocksTool_DefaultInit'
      - MULT: '0'
      - icr: '0'
    - filterConfig:
      - clockSource: 'GlitchFilterClock'
      - clockSourceFreq: 'ClocksTool_DefaultInit'
      - FLT: '150 ns'
    - control:
      - SHEN: '0'
      - HDRS: '0'
      - TX: '0'
      - TXAK: '0'
      - FACK: 'false'
      - DMAEN: 'false'
      - TCKSEL: '0'
      - SSLT: '0'
    - enableSlave: 'true'
    - slaveCfg:
      - ADEXT: '0'
      - AD: '0'
      - GCAEN: 'false'
      - ALERTEN: 'false'
      - SIICAEN: 'false'
      - SAD: '0x61'
      - RMEN: 'false'
      - RA: '0'
    - IICIE: 'false'
    - interruptSources:
      - SSIE: 'false'
      - SHTF2IE: 'false'
      - WUEN: 'false'
    - enable_irq: 'false'
    - interrupt:
      - IRQn: 'kI2C0_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - i2c_params: []
    - quick_selection: 'default'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void I2C0_init(void) {
/****************************************************************************/
/* I2C0 initialization */
/****************************************************************************/
  /* Software peripheral reset to a known state. */
  SIM->PSWR1 |= SIM_PSWR1_IIC0_MASK;
  SIM->PSWR1 &= ~ SIM_PSWR1_IIC0_MASK;
#if defined(I2C0_A1_INIT)
  I2C0->A1 = I2C0_A1_INIT;
#endif /* I2C0_A1_INIT */
#if defined(I2C0_F_INIT)
  I2C0->F = I2C0_F_INIT;
#endif /* I2C0_F_INIT */
#if defined(I2C0_C2_INIT)
  I2C0->C2 = I2C0_C2_INIT;
#endif /* I2C0_C2_INIT */
#if defined(I2C0_FLT_INIT)
  I2C0->FLT = I2C0_FLT_INIT;
#endif /* I2C0_FLT_INIT */
#if defined(I2C0_RA_INIT)
  I2C0->RA = I2C0_RA_INIT;
#endif /* I2C0_RA_INIT */
#if defined(I2C0_SMB_INIT)
  I2C0->SMB = I2C0_SMB_INIT;
#endif /* I2C0_SMB_INIT */
#if defined(I2C0_A2_INIT)
  I2C0->A2 = I2C0_A2_INIT;
#endif /* I2C0_A2_INIT */
#if defined(I2C0_SLTH_INIT)
  I2C0->SLTH = I2C0_SLTH_INIT;
#endif /* I2C0_SLTH_INIT */
#if defined(I2C0_SLTL_INIT)
  I2C0->SLTL = I2C0_SLTL_INIT;
#endif /* I2C0_SLTL_INIT */
#if defined(I2C0_C1_INIT)
  I2C0->C1 = I2C0_C1_INIT;
#endif /* I2C0_C1_INIT */
}

