chouchiate/MC56_LLC_800W_DCDC/board/peripherals.c
/***********************************************************************************************************************
 * QSCI1 initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'QSCI1'
- type: 'qsci_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'qsci_reg_2d9323f68f6773d3646d5e49c6c75606'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'QSCI1'
- config_sets:
  - fsl_qsci:
    - qsciConfig:
      - clockSource: 'BusInterfaceClock'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - DividerBaudRateStr: '115200bps'
      - parityEnable: 'false'
      - parityMode: '0'
      - dataBitCount: '0'
      - polarityMode: '0'
      - fifoEn: 'false'
      - txFifoWatermark: '0'
      - rxFifoWatermark: '1'
      - enableTx: 'false'
      - enableRx: 'false'
      - LINSlaveEnable: 'false'
      - LoopEnable: 'false'
      - ReceiverSource: '0'
      - WaitEnable: 'false'
      - StopHoldEnable: 'false'
      - StandbyEnable: 'false'
      - WakeUpCondition: '0'
      - txDMAEn: 'false'
      - rxDMAEn: 'false'
      - interrupt_vectors:
        - interrupt_types: ''
        - enable_tx_irq: 'false'
        - interrupt_tx:
          - IRQn: 'kQSCI1_TDRE_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_rx_irq: 'false'
        - interrupt_rx:
          - IRQn: 'kQSCI1_RCV_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_rx_err_irq: 'false'
        - interrupt_rx_err:
          - IRQn: 'kQSCI1_RERR_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - enable_tridle_irq: 'false'
        - interrupt_tridle:
          - IRQn: 'kQSCI1_TRIDLE_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
    - qsci_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void QSCI1_init(void) {
/****************************************************************************/
/* QSCI1 initialization */
/****************************************************************************/
  /* Software peripheral reset to a known state. */
  SIM->PSWR1 |= SIM_PSWR1_SCI1_MASK;
  SIM->PSWR1 &= ~ SIM_PSWR1_SCI1_MASK;
#if defined(QSCI1_RATE_INIT)
  QSCI1->RATE = QSCI1_RATE_INIT;
#endif /* QSCI1_RATE_INIT */
#if defined(QSCI1_CTRL2_INIT)
  QSCI1->CTRL2 = QSCI1_CTRL2_INIT;
#endif /* QSCI1_CTRL2_INIT */
#if defined(QSCI1_CTRL3_INIT)
  QSCI1->CTRL3 = QSCI1_CTRL3_INIT;
#endif /* QSCI1_CTRL3_INIT */
#if defined(QSCI1_CTRL1_INIT)
  QSCI1->CTRL1 = QSCI1_CTRL1_INIT;
#endif /* QSCI1_CTRL1_INIT */

}

/***********************************************************************************************************************
 * PIT0 initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'PIT0'
- type: 'pit_reg'
- mode: 'PIT_GENERAL'
- custom_name_enabled: 'false'
- type_id: 'pit_reg_6035bba38bcf2931406cb9b038081d5d'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'PIT0'
- config_sets:
  - pit_reg:
    - clock_config:
      - clockSource: 'kAltClock0'
      - clockSourceFreq: 'BOARD_BootClockRUN'
      - prescaler: 'p0'
      - modulo: '6510'
    - slaveMode: 'false'
    - enableCounter: 'true'
    - enableRollOverInterruptSource: 'false'
    - enable_irq: 'false'
    - interrupt:
      - IRQn: 'kPIT0_ROLLOVR_VECTORn'
      - dsc_enable_interrrupt: 'iprVal1'
      - enable_custom_name: 'false'
    - pit_template_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void PIT0_init(void) {
/****************************************************************************/
/* PIT0 initialization */
/****************************************************************************/
    /* Software reset PIT0. */
    SIM->PSWR2 |= SIM_PSWR2_PIT0_MASK;
    SIM->PSWR2 &= ~ SIM_PSWR2_PIT0_MASK;

#if defined(PIT0_MOD_L_INIT) && defined(PIT0_MOD_H_INIT)
    PIT0->MOD_L = PIT0_MOD_L_INIT;
    PIT0->MOD_H = PIT0_MOD_H_INIT;
#endif
#if defined(PIT0_MOD_INIT)
    PIT0->MOD = PIT0_MOD_INIT;
#endif
#if defined(PIT0_FILT_INIT)
    PIT0->FILT = PIT0_FILT_INIT;
#endif
#if defined(PIT0_CTRL2_INIT)
    PIT0->CTRL2 = PIT0_CTRL2_INIT;
#endif
#if defined(PIT0_CTRL_INIT)
#if ((PIT0_CTRL_INIT & PIT_CTRL_CNT_EN_MASK) != 0)
    PIT0->CTRL = (PIT0_CTRL_INIT & (~PIT_CTRL_CNT_EN_MASK));
    PIT0->CTRL |= PIT_CTRL_CNT_EN_MASK;
#else
    PIT0->CTRL = PIT0_CTRL_INIT;
#endif
#endif
}

/***********************************************************************************************************************
 * Initialization functions
 **********************************************************************************************************************/
static void BOARD_InitPeripherals_CommonPreInit(void)
{
  /* Disable all interrupts to prevent invoking of any interrupt during initialization of peripherals. */
  INTC->CTRL |= INTC_CTRL_INT_DIS_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH0_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH1_MASK;
  /* Enable clock gate of the QSCI0 peripheral. */
  SIM->PCE1 |= SIM_PCE1_SCI0_MASK;
  /* Enable clock gate of the ADC peripheral. */
  SIM->PCE2 |= SIM_PCE2_CYCADC_MASK;
  /* Enable clock gate of the DACA peripheral. */
  SIM->PCE1 |= SIM_PCE1_DACA_MASK;
  /* Enable clock gate of the DACB peripheral. */
  SIM->PCE1 |= SIM_PCE1_DACB_MASK;
  /* Enable clock gate of the CMPA peripheral. */
  SIM->PCE2 |= SIM_PCE2_CMPA_MASK;
  /* Enable clock gate of the CMPB peripheral. */
  SIM->PCE2 |= SIM_PCE2_CMPB_MASK;
  /* Enable clock gate of the I2C0 peripheral. */
  SIM->PCE1 |= SIM_PCE1_IIC0_MASK;
  /* Enable clock gate of the QSCI1 peripheral. */
  SIM->PCE1 |= SIM_PCE1_SCI1_MASK;
  /* Enable clock gate of the PIT0 peripheral. */
  SIM->PCE2 |= SIM_PCE2_PIT0_MASK;
}

static void BOARD_InitPeripherals_CommonPostInit(void)
{
  /* Set the interrupt priority: Priority 2 of the kADC12_CC0_VECTORn request in the INTC. */
  INTC->IPR2 = (INTC->IPR2 & ~INTC_IPR2_ADC_CC0_MASK) | INTC_IPR2_ADC_CC0(3);
  /* Set the interrupt priority: Priority 2 of the kCMPA_VECTORn request in the INTC. */
  INTC->IPR10 = (INTC->IPR10 & ~INTC_IPR10_CMPA_MASK) | INTC_IPR10_CMPA(3);
  /* Set the interrupt priority: Priority 2 of the kCMPB_VECTORn request in the INTC. */
  INTC->IPR10 = (INTC->IPR10 & ~INTC_IPR10_CMPB_MASK) | INTC_IPR10_CMPB(3);
  /* Enable all interrupts after initialization of peripherals. */
  INTC->CTRL &= ~INTC_CTRL_INT_DIS_MASK;
  /* Initialization of masked/enabled DSC core interrupt levels. */
  __EI(3);
}

void BOARD_InitPeripherals(void)
{
  /* Common pre-initialization */
  BOARD_InitPeripherals_CommonPreInit();
  /* Initialize components */
  XBARA_init();
  PWMA_init();
  QSCI0_init();
  ADC_init();
  DACA_init();
  DACB_init();
  CMPA_init();
  CMPB_init();
  I2C0_init();
  QSCI1_init();
  PIT0_init();
  /* Common post-initialization */
  BOARD_InitPeripherals_CommonPostInit();
}

/***********************************************************************************************************************
 * BOARD_InitBootPeripherals function
 **********************************************************************************************************************/
void BOARD_InitBootPeripherals(void)
{
  BOARD_InitPeripherals();
}
